sprint_dec24_to_Jan08/new_data_split.org
#+HTML_HEAD: <link rel="stylesheet" href="https://latex.now.sh/style.css">
#+TITLE: New data split
* Aim
1. The validation curve using two complete sessions in validation data has
  resulted in non-smooth curve that does not show decrease in
  loss.
2. More sessions are required in the testing.
  
* Guiding principles
- There should be atleast 4 sessions in the testing.
- The validation and training can share sessions from same
  group.
  
* Writing/nowriting new data set
** Sessions having complete ground truth
- The following sessions have complete writing ground truth.
- The information is taken from the proposal.

| Group   | Date   |
|---------+--------|
| C1L1P-B | Mar 02 |
| C1L1P-C | Mar 30 |
| C1L1P-C | Apr 13 |
| C1L1P-D | Apr 13 |
| C1L1P-E | Mar 02 |
| C2L1P-B | Feb 23 |
| C2L1P-C | Apr 12 |
| C2L1P-D | Mar 08 |
| C2L1P-E | Apr 12 |
| C3L1P-C | Apr 11 |
| C3L1P-D | Feb 21 |
| C3L1W-D | Mar 19 |

** Testing sessions in hand detection

| Group   | Date   | fully labeled? |
|---------+--------+----------------|
| C1L1P-C | Mar 30 | Yes            |
| C1L1P-C | Apr 13 | Yes            |
| C1L1P-E | Mar 02 | Yes            |
| C2L1P-B | Feb 23 | Yes            |
| C2L1P-D | Mar 08 | Yes            |
| C3L1P-C | Apr 11 | Yes            |
| C3L1P-D | Mar 19 | Yes            |

** Original data split
Originally we organized the data splits so that the validation
and testing will have sessions that are fully labeled. This is
available in the file =trn-val-tst-splits-two-val-sess.csv=. The table
below summarizes them,

| Split label | Sessions                       |
|-------------+--------------------------------|
| Validation  | C2L1P-C Apr 12, C2L1P-E Apr12  |
| Testing     | C1L1P-C Apr 13, C3L1P-C Apr 11 |
| Training    | /The rest of them/             |

** New data split
*** Testing
| Group   |     Date | Date  | Data split label | fully  labeled? |
|---------+----------+-------+------------------+-----------------|
| C1L1P-C | 20170330 | Mar30 | tst              | yes             |
| C1L1P-E | 20170302 | Mar02 | tst              | yes             |
| C2L1P-B | 20180223 | Feb23 | tst              | yes             |
| C3L1P-C | 20190411 | Apr11 | tst              | yes             |

*** Validation
| Group   |     Date | Date  | Data split label | Fully labeled? |
|---------+----------+-------+------------------+----------------|
| C1L1P-C | 20170225 | Feb25 | val              | no             |
| C1L1P-C | 20170309 | Mar09 | val              | no             |
| C1L1P-C | 20170406 | Apr06 | val              | no             |
| C1L1P-D | 20170302 | Mar02 | val              | no             |
| C1L1P-D | 20170330 | Mar30 | val              | no             |
| C1L1W-A | 20170221 | Feb21 | val              | no             |

*** Training
The rest of the sessions are used for training.

*** Using all writing & nowriting instances
- Taking one three second instance from the middle of every activity
  instance.

|                     | Training | Validation | Testing |
|---------------------+----------+------------+---------|
| # writing samples   |      407 |        141 |     250 |
| # nowriting samples |      191 |         67 |     376 |

