sprint_dec24_to_Jan08/new_data_split.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-28 Wed 10:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>New data split</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://latex.now.sh/style.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">New data split</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7d2b8ae">1. Aim</a></li>
<li><a href="#orgaf99a5c">2. Guiding principles</a></li>
<li><a href="#orgfc600a7">3. Writing/nowriting data set</a>
<ul>
<li><a href="#orgdbf9f72">3.1. Sessions having complete ground truth</a></li>
<li><a href="#orgabe2ded">3.2. Testing sessions in hand detection</a></li>
<li><a href="#org3c353a4">3.3. Original data split</a></li>
<li><a href="#org219e6dc">3.4. New data split</a>
<ul>
<li><a href="#org74bb877">3.4.1. Testing</a></li>
<li><a href="#orgacd2735">3.4.2. Validation</a></li>
<li><a href="#org577908a">3.4.3. Training</a></li>
<li><a href="#org1899bd5">3.4.4. Using all writing &amp; nowriting instances</a></li>
<li><a href="#orgd195524">3.4.5. Using balanced dataset</a></li>
</ul>
</li>
<li><a href="#org746433c">3.5. Results</a>
<ul>
<li><a href="#org08fba3a">3.5.1. Using all writing &amp; nowriting instances</a></li>
<li><a href="#org28a524b">3.5.2. Using all typing &amp; notyping instances</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org21952a6">4. Typing/notyping data set</a>
<ul>
<li><a href="#orge53be89">4.1. Sessions having complete tying,notyping ground truth</a></li>
<li><a href="#orgfb5926b">4.2. Testing sessions in keybaord detection</a></li>
<li><a href="#org288e62b">4.3. Original data split</a></li>
<li><a href="#org6641157">4.4. New data split</a>
<ul>
<li><a href="#org7952dc2">4.4.1. Testing</a></li>
<li><a href="#org39ee2ad">4.4.2. Validation</a></li>
<li><a href="#org73c11d2">4.4.3. Training</a></li>
<li><a href="#org746843c">4.4.4. Using all typing &amp; notyping instances</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org7d2b8ae" class="outline-2">
<h2 id="org7d2b8ae"><span class="section-number-2">1.</span> Aim</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>The validation curve using two complete sessions in validation data has
resulted in non-smooth curve that does not show decrease in
loss.</li>
<li>More sessions are required in the testing.</li>
</ol>
</div>
</div>

<div id="outline-container-orgaf99a5c" class="outline-2">
<h2 id="orgaf99a5c"><span class="section-number-2">2.</span> Guiding principles</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>There should be atleast 4 sessions in the testing.</li>
<li>The validation and training can share sessions from same
group.</li>
</ul>
</div>
</div>

<div id="outline-container-orgfc600a7" class="outline-2">
<h2 id="orgfc600a7"><span class="section-number-2">3.</span> Writing/nowriting data set</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgdbf9f72" class="outline-3">
<h3 id="orgdbf9f72"><span class="section-number-3">3.1.</span> Sessions having complete ground truth</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>The following sessions have complete writing ground truth.</li>
<li>The information is taken from the proposal.</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Group</th>
<th scope="col" class="org-left">Date</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C1L1P-B</td>
<td class="org-left">Mar 02</td>
</tr>

<tr>
<td class="org-left">C1L1P-C</td>
<td class="org-left">Mar 30</td>
</tr>

<tr>
<td class="org-left">C1L1P-C</td>
<td class="org-left">Apr 13</td>
</tr>

<tr>
<td class="org-left">C1L1P-D</td>
<td class="org-left">Apr 13</td>
</tr>

<tr>
<td class="org-left">C1L1P-E</td>
<td class="org-left">Mar 02</td>
</tr>

<tr>
<td class="org-left">C2L1P-B</td>
<td class="org-left">Feb 23</td>
</tr>

<tr>
<td class="org-left">C2L1P-C</td>
<td class="org-left">Apr 12</td>
</tr>

<tr>
<td class="org-left">C2L1P-D</td>
<td class="org-left">Mar 08</td>
</tr>

<tr>
<td class="org-left">C2L1P-E</td>
<td class="org-left">Apr 12</td>
</tr>

<tr>
<td class="org-left">C3L1P-C</td>
<td class="org-left">Apr 11</td>
</tr>

<tr>
<td class="org-left">C3L1P-D</td>
<td class="org-left">Feb 21</td>
</tr>

<tr>
<td class="org-left">C3L1W-D</td>
<td class="org-left">Mar 19</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgabe2ded" class="outline-3">
<h3 id="orgabe2ded"><span class="section-number-3">3.2.</span> Testing sessions in hand detection</h3>
<div class="outline-text-3" id="text-3-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Group</th>
<th scope="col" class="org-left">Date</th>
<th scope="col" class="org-left">fully labeled?</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C1L1P-C</td>
<td class="org-left">Mar 30</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">C1L1P-C</td>
<td class="org-left">Apr 13</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">C1L1P-E</td>
<td class="org-left">Mar 02</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">C2L1P-B</td>
<td class="org-left">Feb 23</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">C2L1P-D</td>
<td class="org-left">Mar 08</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">C3L1P-C</td>
<td class="org-left">Apr 11</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">C3L1P-D</td>
<td class="org-left">Mar 19</td>
<td class="org-left">Yes</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org3c353a4" class="outline-3">
<h3 id="org3c353a4"><span class="section-number-3">3.3.</span> Original data split</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Originally we organized the data splits so that the validation
and testing will have sessions that are fully labeled. This is
available in the file <code>trn-val-tst-splits-two-val-sess.csv</code>. The table
below summarizes them,
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Split label</th>
<th scope="col" class="org-left">Sessions</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Validation</td>
<td class="org-left">C2L1P-C Apr 12, C2L1P-E Apr12</td>
</tr>

<tr>
<td class="org-left">Testing</td>
<td class="org-left">C1L1P-C Apr 13, C3L1P-C Apr 11</td>
</tr>

<tr>
<td class="org-left">Training</td>
<td class="org-left"><i>The rest of them</i></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org219e6dc" class="outline-3">
<h3 id="org219e6dc"><span class="section-number-3">3.4.</span> New data split</h3>
<div class="outline-text-3" id="text-3-4">
</div>
<div id="outline-container-org74bb877" class="outline-4">
<h4 id="org74bb877"><span class="section-number-4">3.4.1.</span> Testing</h4>
<div class="outline-text-4" id="text-3-4-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Group</th>
<th scope="col" class="org-right">Date</th>
<th scope="col" class="org-left">Date</th>
<th scope="col" class="org-left">Data split label</th>
<th scope="col" class="org-left">fully  labeled?</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C1L1P-C</td>
<td class="org-right">20170330</td>
<td class="org-left">Mar30</td>
<td class="org-left">tst</td>
<td class="org-left">yes</td>
</tr>

<tr>
<td class="org-left">C1L1P-E</td>
<td class="org-right">20170302</td>
<td class="org-left">Mar02</td>
<td class="org-left">tst</td>
<td class="org-left">yes</td>
</tr>

<tr>
<td class="org-left">C2L1P-B</td>
<td class="org-right">20180223</td>
<td class="org-left">Feb23</td>
<td class="org-left">tst</td>
<td class="org-left">yes</td>
</tr>

<tr>
<td class="org-left">C3L1P-C</td>
<td class="org-right">20190411</td>
<td class="org-left">Apr11</td>
<td class="org-left">tst</td>
<td class="org-left">yes</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgacd2735" class="outline-4">
<h4 id="orgacd2735"><span class="section-number-4">3.4.2.</span> Validation</h4>
<div class="outline-text-4" id="text-3-4-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Group</th>
<th scope="col" class="org-right">Date</th>
<th scope="col" class="org-left">Date</th>
<th scope="col" class="org-left">Data split label</th>
<th scope="col" class="org-left">Fully labeled?</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C1L1P-C</td>
<td class="org-right">20170225</td>
<td class="org-left">Feb25</td>
<td class="org-left">val</td>
<td class="org-left">no</td>
</tr>

<tr>
<td class="org-left">C1L1P-C</td>
<td class="org-right">20170309</td>
<td class="org-left">Mar09</td>
<td class="org-left">val</td>
<td class="org-left">no</td>
</tr>

<tr>
<td class="org-left">C1L1P-C</td>
<td class="org-right">20170406</td>
<td class="org-left">Apr06</td>
<td class="org-left">val</td>
<td class="org-left">no</td>
</tr>

<tr>
<td class="org-left">C1L1P-D</td>
<td class="org-right">20170302</td>
<td class="org-left">Mar02</td>
<td class="org-left">val</td>
<td class="org-left">no</td>
</tr>

<tr>
<td class="org-left">C1L1P-D</td>
<td class="org-right">20170330</td>
<td class="org-left">Mar30</td>
<td class="org-left">val</td>
<td class="org-left">no</td>
</tr>

<tr>
<td class="org-left">C1L1W-A</td>
<td class="org-right">20170221</td>
<td class="org-left">Feb21</td>
<td class="org-left">val</td>
<td class="org-left">no</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org577908a" class="outline-4">
<h4 id="org577908a"><span class="section-number-4">3.4.3.</span> Training</h4>
<div class="outline-text-4" id="text-3-4-3">
<p>
The rest of the sessions are used for training.
</p>
</div>
</div>
