sprint_dec24_to_Jan08/new_data_split.html

<div id="outline-container-org1899bd5" class="outline-4">
<h4 id="org1899bd5"><span class="section-number-4">3.4.4.</span> Using all writing &amp; nowriting instances</h4>
<div class="outline-text-4" id="text-3-4-4">
<ul class="org-ul">
<li>Taking one three second instance from the middle of every activity
instance.</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">Training</th>
<th scope="col" class="org-right">Validation</th>
<th scope="col" class="org-right">Testing</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"># writing samples</td>
<td class="org-right">407</td>
<td class="org-right">141</td>
<td class="org-right">250</td>
</tr>

<tr>
<td class="org-left"># nowriting samples</td>
<td class="org-right">191</td>
<td class="org-right">67</td>
<td class="org-right">376</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgd195524" class="outline-4">
<h4 id="orgd195524"><span class="section-number-4">3.4.5.</span> Using balanced dataset</h4>
<div class="outline-text-4" id="text-3-4-5">
<ul class="org-ul">
<li>Taking one three second instance from the middle of every activity
instance.</li>
<li>Randomly sampling to have balanced dataset</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">Training</th>
<th scope="col" class="org-right">Validation</th>
<th scope="col" class="org-right">Testing</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"># writing samples</td>
<td class="org-right">180</td>
<td class="org-right">50</td>
<td class="org-right">250</td>
</tr>

<tr>
<td class="org-left"># nowriting samples</td>
<td class="org-right">180</td>
<td class="org-right">50</td>
<td class="org-right">250</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org746433c" class="outline-3">
<h3 id="org746433c"><span class="section-number-3">3.5.</span> Results</h3>
<div class="outline-text-3" id="text-3-5">
</div>
<div id="outline-container-org08fba3a" class="outline-4">
<h4 id="org08fba3a"><span class="section-number-4">3.5.1.</span> Using all writing &amp; nowriting instances</h4>
<div class="outline-text-4" id="text-3-5-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Method</th>
<th scope="col" class="org-right">Acc. Trn.</th>
<th scope="col" class="org-right">Acc. Val.</th>
<th scope="col" class="org-right">Loss Trn.</th>
<th scope="col" class="org-left">Loss Val.</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">3D-CNN, 30 FPS</td>
<td class="org-right"><b>87.62</b></td>
<td class="org-right"><b>81.73</b></td>
<td class="org-right">0.31</td>
<td class="org-left">0.49</td>
</tr>

<tr>
<td class="org-left">3D-CNN, 20 FPS</td>
<td class="org-right">87.27</td>
<td class="org-right">73.11</td>
<td class="org-right">0.31</td>
<td class="org-left">0.61</td>
</tr>

<tr>
<td class="org-left">3D-CNN, 10 FPS</td>
<td class="org-right">86.78</td>
<td class="org-right">77.88</td>
<td class="org-right"><b>0.28</b></td>
<td class="org-left"><b>0.45</b></td>
</tr>

<tr>
<td class="org-left">I3D, 30 FPS</td>
<td class="org-right">77.5</td>
<td class="org-right">77.40</td>
<td class="org-right">0.48</td>
<td class="org-left">---</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org28a524b" class="outline-4">
<h4 id="org28a524b"><span class="section-number-4">3.5.2.</span> Using all typing &amp; notyping instances</h4>
<div class="outline-text-4" id="text-3-5-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Method</th>
<th scope="col" class="org-right">Acc. Trn.</th>
<th scope="col" class="org-left">Acc. Val.</th>
<th scope="col" class="org-right">Loss Trn.</th>
<th scope="col" class="org-left">Loss Val.</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">3D-CNN, 30 FPS</td>
<td class="org-right">88.30</td>
<td class="org-left"><b>91.83</b></td>
<td class="org-right"><b>0.28</b></td>
<td class="org-left">0.27</td>
</tr>

<tr>
<td class="org-left">3D-CNN, 20 FPS</td>
<td class="org-right"><b>89.03</b></td>
<td class="org-left"><b>91.83</b></td>
<td class="org-right">0.29</td>
<td class="org-left">0.26</td>
</tr>

<tr>
<td class="org-left">3D-CNN, 10 FPS</td>
<td class="org-right">86.69</td>
<td class="org-left">89.79</td>
<td class="org-right">0.33</td>
<td class="org-left"><b>0.25</b></td>
</tr>

<tr>
<td class="org-left">I3D, 30 FPS</td>
<td class="org-right">72.50</td>
<td class="org-left">87.75</td>
<td class="org-right">0.50</td>
<td class="org-left">---</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>

<div id="outline-container-org21952a6" class="outline-2">
<h2 id="org21952a6"><span class="section-number-2">4.</span> Typing/notyping data set</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orge53be89" class="outline-3">
<h3 id="orge53be89"><span class="section-number-3">4.1.</span> Sessions having complete tying,notyping ground truth</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>The following sessions have complete typing ground truth.</li>
<li>The information is taken from the proposal.</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Group</th>
<th scope="col" class="org-left">Date</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C1L1P-C</td>
<td class="org-left">Mar 30, Apr 13, May 04</td>
</tr>

<tr>
<td class="org-left">C1L1P-E</td>
<td class="org-left">Mar 02</td>
</tr>

<tr>
<td class="org-left">C2L1P-B</td>
<td class="org-left">Feb 23</td>
</tr>

<tr>
<td class="org-left">C2L1P-D</td>
<td class="org-left">Mar 08</td>
</tr>

<tr>
<td class="org-left">C2L1W-A</td>
<td class="org-left">Apr 10</td>
</tr>

<tr>
<td class="org-left">C2L1W-B</td>
<td class="org-left">Feb 27</td>
</tr>

<tr>
<td class="org-left">C3L1P-C</td>
<td class="org-left">Apr 11</td>
</tr>

<tr>
<td class="org-left">C3L1P-D</td>
<td class="org-left">Feb 21</td>
</tr>

<tr>
<td class="org-left">C3L1W-A</td>
<td class="org-left">Mar 19</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgfb5926b" class="outline-3">
<h3 id="orgfb5926b"><span class="section-number-3">4.2.</span> Testing sessions in keybaord detection</h3>
<div class="outline-text-3" id="text-4-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Group</th>
<th scope="col" class="org-left">Date</th>
<th scope="col" class="org-left">fully labeled?</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C1L1P-C</td>
<td class="org-left">Mar 30</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">C1L1P-C</td>
<td class="org-left">Apr 13</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">C1L1P-E</td>
<td class="org-left">Mar 02</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">C2L1P-B</td>
<td class="org-left">Feb 23</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">C2L1P-D</td>
<td class="org-left">Mar 08</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">C3L1P-C</td>
<td class="org-left">Apr 11</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">C3L1P-D</td>
<td class="org-left">Mar 19</td>
<td class="org-left">Yes</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org288e62b" class="outline-3">
<h3 id="org288e62b"><span class="section-number-3">4.3.</span> Original data split</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>The file name is <code>trn-val-tst-splits-backup-20221214.csv</code>.</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Group</th>
<th scope="col" class="org-left">Date</th>
<th scope="col" class="org-left">data split label</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C1L1P-E</td>
<td class="org-left">Mar 02</td>
<td class="org-left">validation</td>
</tr>

<tr>
<td class="org-left">C2L1P-D</td>
<td class="org-left">Mar 08</td>
<td class="org-left">validation</td>
</tr>

<tr>
<td class="org-left">C2L1P-B</td>
<td class="org-left">Feb 23</td>
<td class="org-left">testing</td>
</tr>

<tr>
<td class="org-left">C3L1P-D</td>
<td class="org-left">Feb 21</td>
<td class="org-left">testing</td>
</tr>
</tbody>
</table>
</div>
</div>
